UI-Toolkit-v1.0/ui-template-v1.0/orgtest/exp1/content.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Physics Lab</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-06-20 10:42:25 IST"/>
<meta name="author" content="Chanakya Aalla"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Physics Lab</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Simple Pendulum </a>
<ul>
<li><a href="#sec-1.1">Introduction </a></li>
<li><a href="#sec-1.2">Theory </a></li>
<li><a href="#sec-1.3">Objective </a></li>
<li><a href="#sec-1.4">Manual </a></li>
<li><a href="#sec-1.5">Quizzes </a></li>
<li><a href="#sec-1.6">Procedure </a></li>
<li><a href="#sec-1.7">Further Readings </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Simple Pendulum </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">Introduction </h3>
<div class="outline-text-3" id="text-1.1">


<p>
In this module, basic concepts of simple oscillator are explained. Initially, an example of simple pendulum is taken and the basic terminology i.e., what is initial displacement, initial velocity,natural frequency and time period are explained. Each of these terms is illustrated by giving an example, where user can enter his value and observe the behavior of structure for his input.
</p>
<p>
Simple harmonic oscillator consists of a mass (m) hanging from a string of length (l), fixed at a pivot point P. When the mass is displaced from its mean position by giving some initial displacement (angle), oscillator starts swinging back and fourth with periodic motion.
pendulum
</p></div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">Theory </h3>
<div class="outline-text-3" id="text-1.2">


<p>
There are two solutions to \(ax<sup>2</sup> + bx + c = 0\) and they are $$x = {-b &plusmn; \sqrt{b<sup>2</sup>-4ac} \over 2a}.$$
</p>
<p>
By applying Newton's second law for rotational systems, the equation of motion for the pendulum may be obtained.
</p>
<p>
Here \(&tau;\) = Torque ; I = Moment of Inertia; α = Angular Velocity. m is mass of the oscillator, l is the length of the oscillator and \(&theta;\) is initial displacement.
</p>
<p>
If the amplitude of the angular displacement is small then we can use the approximation $$ sin &theta; &asymp; &theta; $$
</p></div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3">Objective </h3>
<div class="outline-text-3" id="text-1.3">


<p>
Objective of simple harmonic oscillator experiment is to understand the concept of time period (natural frequency) in harmonic oscillations .
simple pendulum
Experiment
</p>
<p>
Place or link to your experiment java applet or flash file here.
</p></div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4">Manual </h3>
<div class="outline-text-3" id="text-1.4">


<p>
Start the experiment with the default values of length, mass and intial displacement (in angle). Pause the experiment after few cycles and note the observation.
Observation 1:
</p>
<p>
Find the time period of the pendulum by noting the time interval of any one complete cycle from the response graph.
You may note that this time period value is same for any complete cycle. Read More
</p>
</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5">Quizzes </h3>
<div class="outline-text-3" id="text-1.5">

<p><b>Q1.</b> 
Time taken for one complete oscillation 
is called Time Period of the oscillator.
</p>



 <input type="radio" name="q1" id="q1" value="1"> 
 <font color="green"> True </font> <br> 
 <input type="radio" name="q1" id="q1" value="0">
 <font color="red"> False </font> <br><br/>

<p>
<b>Q2.</b> 
Time period of the oscillator is constant for 
given values of mass, length and time conditions.
 <input type="radio" name="q2" id="q2" value="1"> 
 <font color="green"> True </font>  
 <input type="radio" name="q2" id="q2"value="0">
<font color="red"> False </font> <br/><br/>
</p>
<p>
<b>Q3.</b> 
Value of Time period depends on initial conditions. 
</p>


 <input type="radio" name="q3" id="q3" value="1"> 
 <font color="green"> True </font> <br> 
 <input type="radio" name="q3" id="q3"value="0">
  <font color="red"> False </font> <br/><br/>

<p>
<b>Q4.</b>
Value of time period depends on mass. &lt;
</p>


 <input type="radio" name="q4" id="q4" value="1"> 
 <font color="green"> True </font> <br> 
 <input type="radio" name="q4" id="q4" value="0">
<font color="red"> False </font> <br/><br/> 

<p>
<b>Q5.</b> 
Value of time period depends on length of the oscillator. 
</p>


  <input type="radio" name="q5" id="q5" value="1"> 
  <font color="green"> True </font> <br> 
   <input type="radio" name="q5" id="q5"value="0">
    <font color="red"> False </font> <br/><br/> 
   <input type="submit" value="Submit Answers"  class="button" />


</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6">Procedure </h3>
<div class="outline-text-3" id="text-1.6">


<p>
Procedure for the experiment is as follows.
</p></div>

</div>

<div id="outline-container-1.7" class="outline-3">
<h3 id="sec-1.7">Further Readings </h3>
<div class="outline-text-3" id="text-1.7">


<p>
<a href="http://en.wikipedia.org/wiki/Simple_harmonic_motion">http://en.wikipedia.org/wiki/Simple_harmonic_motion</a>
<a href="http://www.physics.uoguelph.ca/tutorials/shm/Q.shm.html">http://www.physics.uoguelph.ca/tutorials/shm/Q.shm.html</a>
Dynamics of structures by Anil K chopra.
<a href="http://surendranath.tripod.com/Applets/Oscillations/SHM/SHMApplet.html">http://surendranath.tripod.com/Applets/Oscillations/SHM/SHMApplet.html</a>
</p>

</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Chanakya Aalla
<a href="mailto:chanakya@vaio">&lt;chanakya@vaio&gt;</a>
</p>
<p class="date"> Date: 2011-06-20 10:42:25 IST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
